/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   japanesefunction.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kamitsui <kamitsui@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/08/20 10:39:19 by kamitsui          #+#    #+#             */
/*   Updated: 2023/08/20 10:40:11 by kamitsui         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "my_header.h"

/**
 * @brief 関数の説明
 *
 * この関数は日本語のコメントを含む例です。
 *
 * @param str 説明。
 */
void	JapaneseFunction(char *str)
{
	printf("%s\n", str);
}
